In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:root@127.0.0.1:5432/sparkifydb

'Connected: postgres@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
5 rows affected.

[(1, 1541106106796, 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (2, 1541106352796, 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (3, 1541106496796, 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (4, 1541106673796, 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (5, 1541107053796, 8, 'free', None, None, 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
5 rows affected.

[(15, 'Lily', 'Koch', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (3, 'Isaac', 'Valdez', 'M', 'free'),
 (42, 'Harper', 'Barrett', 'M', 'paid'),
 (59, 'Lily', 'Cooper', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.9318),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148.03546),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, 177.47546),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.60608)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', 35.14968, -90.04892),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', nan, nan),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan),
 ('ARXR32B1187FB57099', 'Gob', '', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
5 rows affected.

[(1541106106796, 0, 1, 1, 'January', 1970, 'Thursday'),
 (1541106352796, 0, 1, 1, 'January', 1970, 'Thursday'),
 (1541106496796, 0, 1, 1, 'January', 1970, 'Thursday'),
 (1541106673796, 0, 1, 1, 'January', 1970, 'Thursday'),
 (1541107053796, 0, 1, 1, 'January', 1970, 'Thursday')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [8]:
# time = 6813
%sql select count(*) from time;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
1 rows affected.

[(6813,)]

In [9]:
# artists = 69
%sql select count(*) from artists;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
1 rows affected.

[(69,)]

In [10]:
# songs = 71
%sql select count(*) from songs;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
1 rows affected.

[(71,)]

In [11]:
# users = 96
%sql select count(*) from users;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
1 rows affected.

[(96,)]

In [12]:
# songplays = 6820
%sql select count(*) from songplays;

 * postgresql://postgres:***@127.0.0.1:5432/sparkifydb
1 rows affected.

[(6820,)]